app/views/api/properties/index.json.jbuilder

SELECT "photos".* FROM "photos" WHERE "photos"."property_id" = $1  [["property_id", 16]]
---
  json.price property.get_price
  json.photos property.get_photos.first