app/controllers/api/photos_controller.rb

  def index (filter = nil)
    if !filter
      @photos = Photo.order(created_at: :desc).all
---
SELECT "photos".* FROM "photos"  ORDER BY "photos"."created_at" DESC