app/controllers/api/properties_controller.rb

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."property_id" = $1 LIMIT 1  [["property_id", 1]]
SELECT "properties".* FROM "properties" WHERE (bathrooms >= 4.0)
SELECT "properties".* FROM "properties"
---
  def index
    minPrice = params[:minPrice]
    maxPrice = params[:maxPrice]
    bedrooms = params[:bedrooms]
    bathrooms = params[:bathrooms]
    neighborhood = params[:neighborhood]
    location = params[:location]

    if neighborhood.present?
      @properties = Property.joins(:address)
      @properties = @properties.where("neighborhood LIKE ?", neighborhood)
    else
      @properties = Property.all

SELECT  "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT 1  [["id", 2]]
---
  def show
    property = Property.find(params[:id])