app/controllers/api/saved_properties_controller.rb

  def index
    user_id = params[:user_id]
    if user_id.present?
      @saved_properties = Property.joins(:saved_properties)
                          .where("user_id = ? ", user_id)
---
SELECT "properties".* FROM "properties" INNER JOIN "saved_properties" ON "saved_properties"."property_id" = "properties"."id" WHERE (user_id = '2' )

  def create
    @saved_property = SavedProperty.create!(saved_property_params)
---
INSERT INTO "saved_properties" ("user_id", "property_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["property_id", 1], ["created_at", "2015-12-15 13:34:02.155361"], ["updated_at", "2015-12-15 13:34:02.155361"]]

  def destroy
    @saved_property = SavedProperty.find(params[:id])
    @saved_property.destroy
---
SELECT  "saved_properties".* FROM "saved_properties" WHERE "saved_properties"."id" = $1 LIMIT 1  [["id", 17]]
DELETE FROM "saved_properties" WHERE "saved_properties"."id" = $1  [["id", 17]]