app/views/api/sessions/show.json.jbuilder

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "gc-vMHooFKpHwHXDIHOHUQ"], ["updated_at", "2015-12-16 02:13:14.718481"], ["id", 2]]
---
json.saved_properties do
  json.array! @user.saved_properties, :id, :property_id